Repository: yanisfaquir/altice-weather-yanisfaquir
Catalog: src/locale/messages.*.xlf
Languages: pt

# nav-dashboard
source: Dashboard
pt: Painel Principal

# nav-add-data
source: Add Data
pt: Adicionar Dados

# nav-cities
source: Cities
pt: Cidades

# main-title
source: Weather Communication Dashboard
pt: Dashboard de Comunicação Meteorológica

# main-subtitle
source: Collecting weather data and analyzing its impact on communications across multiple cities.
pt: Recolhendo dados meteorológicos e analisando o seu impacto nas comunicações em múltiplas cidades.

# stat-cities-monitored
source: Cities Monitored
pt: Cidades Monitorizadas

# stat-data-records
source: Data Records
pt: Registos de Dados

# stat-avg-network
source: Avg Network Power
pt: Potência de Rede Média

# btn-add-weather-active
source: Add Weather Data
pt: Adicionar Dados Meteorológicos

# btn-add-weather
source: 📊 Add Weather Data
pt: 📊 Adicionar Dados Meteorológicos

# btn-view-cities-active
source: View Cities
pt: Ver Cidades

# btn-view-cities
source: 🏙️ View Cities
pt: 🏙️ Ver Cidades

# btn-settings-active
source: Settings
pt: Definições

# btn-settings
source: ⚙️ Settings
pt: ⚙️ Definições

# btn-analytics
source: 📈 Analytics
pt: 📈 Análises

source: 🚀 Ready to Start!
pt: 🚀 Pronto para Começar!

# choose-option-text
source: Choose an option above to get started: <br><strong>Add Weather Data</strong> to collect new information or <strong>View Cities</strong> to see the dashboard.
pt: Escolha uma opção acima para começar: <br><strong>Adicionar Dados Meteorológicos</strong> para recolher nova informação ou <strong>Ver Cidades</strong> para ver o painel principal.

# footer-copyright
source: © 2024 Altice Labs - Weather Communication Dashboard
pt: © 2024 Altice Labs - Dashboard de Comunicação Meteorológica

# debug-requests
source: Requests: <span [textContent]="apiStats.requestCount">0</span>/100
pt: Pedidos: <span [textContent]="apiStats.requestCount">0</span>/100

# debug-cache
source: Cache: <span [textContent]="apiStats.cacheStats.size">0</span> items
pt: Cache: <span [textContent]="apiStats.cacheStats.size">0</span> itens

# debug-test-api
source: Test API
pt: Testar API

source: Loading city details...
pt: A carregar detalhes da cidade...

# error-loading-city
source: Error Loading City Details
pt: Erro ao Carregar Detalhes da Cidade

# try-again-button
source: Try Again
pt: Tentar Novamente

# detailed-analysis-subtitle
source: Detailed weather and network analysis
pt: Análise detalhada de meteorologia e rede

# refresh-button
source: 🔄 Refresh
pt: 🔄 Actualizar

source: Total Records
pt: Total de Registos

source: Avg Temperature
pt: Temperatura Média

source: Avg Network Power
pt: Potência de Rede Média

source: Avg Altitude
pt: Altitude Média

source: 🌡️ Temperature Analysis
pt: 🌡️ Análise de Temperatura

# temperature-range
source: Range:
pt: Intervalo:

# temperature-trend
source: Trend:
pt: Tendência:

source: 📶 Network Power Distribution
pt: 📶 Distribuição de Potência de Rede

source: 📅 Monthly Analysis
pt: 📅 Análise Mensal

# table-month
source: Month
pt: Mês

# table-records
source: Records
pt: Registos

# table-avg-temp
source: Avg Temp
pt: Temp. Média

# table-avg-network
source: Avg Network
pt: Rede Média

# table-rainy-days
source: Rainy Days
pt: Dias de Chuva

# worst-performance-records
source: 🚨 Worst Network Performance Records
pt: 🚨 Registos de Pior Performance de Rede

# rain-label
source: Rain:
pt: Chuva:

source: 🕒 Recent Records
pt: 🕒 Registos Recentes
